package main

import "fmt"

func main() {
	var str string = "Golang!"

	fmt.Println("Hello ", str)

	//Завдання 1. Вивести текст українською мовою
	fmt.Println("\nЗавдання 1. Вивести текст українською мовою")

	var poem string = "\n\nНіч шумить вітрами осінніми й холодними,\n" +
		"Поля порожні, небо швидко затягнуте,\n" +
		"Сухі листя дерева трясуть,\n" +
		"Буря реве, немов хоче виразити своє незадоволення;\n" +
		"Але всередині, при світлі, ми обидва\n" +
		"Сидимо разом так тісно, так щиро, так вірно,\n" +
		"І співаємо й линемо чудову пісню,\n" +
		"Що так лагідно лунатиме в душах.\n\n" +
		"Скрипки зітхають, флейта спочиває,\n" +
		"Світлі келихи дзвенять, вино іскриться,\n" +
		"Лагідний подих кохання розпускається,\n" +
		"І збуджує серця до палаючої ніжності.\n" +
		"Ми не маємо золота, ми не маємо грошей,\n" +
		"Ми маємо лише одне одного завжди,\n" +
		"Ми веселимося при жартиках, при келиху, при поцілунку,\n" +
		"І коли ми разом, ми все ж самі.\n\n" +
		"Я цілую уста, що такі червоні,\n" +
		"Я стискаю руку, що тепло мене обіймає,\n" +
		"Я дивлюся в очі, що так ясно світять,\n" +
		"І більше бажання я ніколи не маю, щоб настала ніч.\n" +
		"Вона втікає так швидко, години летять,\n" +
		"Моє серце не думає про те, що за межами, що всередині,\n" +
		"Любовний блиск не зникає,\n" +
		"Ми занурюємося у щасливий сон."

	fmt.Println("\nФранц Шуберт - Світла ніч", poem)
}
