package main

import (
	"fmt"
)

func main() {
	var chartype int8 = 'R'

	fmt.Printf("Code '%c' - %d\n", chartype, chartype)

	//Завдання. 1. Вивести українську букву 'Ї'
	fmt.Println("\nЗавдання. 1. Вивести українську букву 'Ї'")

	var letter rune = 'Ї'
	fmt.Printf("%#U %T", letter, letter)

	//Завдання 2. Пояснити призначення типу "rune"
	fmt.Println("\n\nЗавдання 2. Пояснити призначення типу \"rune\"")

	var explanation string = "Тип `rune` - це псевдонім (синонім) для типу `int32` у мові програмування Go. Він використовує 4 байти для зберігання даних та призначений для збереження кодів символів Unicode. " +
		"Unicode - це стандарт, що об'єднує різноманітні символи з різних алфавітів світу.\n" +
		"Кожен символ Unicode має унікальний номер, відомий як кодова точка, і зберігається у типі `rune`.\n" +
		"Такий тип дозволяє нам представляти широкий спектр символів, таких як \"Ї\", які виходять за межі ASCII-символів, що зберігаються у типі `byte`."

	fmt.Println(explanation)
}
